
&НаКлиенте
Процедура Печать(Команда)
	ТабДокумент = ПечатьНаСервере();
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.Показать("Коммерческое")
КонецПроцедуры


&НаСервере
Функция ПечатьНаСервере()
	ТабДокумент = Документы.КоммерческоеПредложение.ПечатьКоммерческого(Объект.Ссылка);
	Возврат ТабДокумент; 
КонецФункции

#Область СобытияФормыДокумента

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ДобавитьСтандартныеСтрокиПодвалаНаСервере();
		
	КонецЕсли; 
	
	
КонецПроцедуры

#Область ОбработкаМакетаПодвала

&НаСервере
Процедура ДобавитьСтандартныеСтрокиПодвалаНаСервере()
	ДобавитьСтрокуВПодвал("ПодсчетыПредварительные");
	ДобавитьСтрокуВПодвал("ДополнительныеДоработкиЗаОтдельнуюПлату");
	ДобавитьСтрокуВПодвал("Актуальность3Дня");
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуВПодвал(Примечание)
	НоваяСтрокаПодвал = Объект.СтрокиПодвала.Добавить();
	НоваяСтрокаПодвал.Примечание = Справочники.МакетПодвал[Примечание];
КонецПроцедуры

#КонецОбласти


#КонецОбласти


#Область СобытияТабличнойЧастиДокумента

// СОБЫТИЯ ПРИ ИЗМЕНЕНИИ
 //////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура ПереченьТоваровЦенаПриИзменении(Элемент)
	ТекДанные = Элементы.ПереченьТоваров.ТекущиеДанные;
	ПересчитатьСумму(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПереченьТоваровКоличествоПриИзменении(Элемент)
	ТекДанные = Элементы.ПереченьТоваров.ТекущиеДанные;
	ПересчитатьСумму(ТекДанные);
КонецПроцедуры

//////////////////////////////////////////////////////////////////


&НаКлиенте
Процедура ПересчитатьСумму(ТекДанные)
	ТекДанные.Сумма = ТекДанные.Цена * ТекДанные.Количество;
КонецПроцедуры

#КонецОбласти
